docs/go-struct-method-interface.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-20 Mon 17:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Struct, Method, Interface</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/zeroorone/style.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<meta name='theme-color' id='theme-color-meta' content='#f5f5f5'>
   <header>
    <nav class='breadcrumb'>
      <a href='/zeroorone/index.html'>Home</a>
      <span class='breadcrumb-sep'>/</span>
      <span class='breadcrumb-current'>Go: Struct, Method, Interface</span>
    </nav>
    <div class='controls'>
      <button class='sidebar-toggle' title='Search'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M18.319 14.4326C20.7628 11.2941 20.542 6.75347 17.6569 3.86829C14.5327 0.744098 9.46734 0.744098 6.34315 3.86829C3.21895 6.99249 3.21895 12.0578 6.34315 15.182C9.22833 18.0672 13.769 18.2879 16.9075 15.8442C16.921 15.8595 16.9351 15.8745 16.9497 15.8891L21.1924 20.1317C21.5829 20.5223 22.2161 20.5223 22.6066 20.1317C22.9971 19.7412 22.9971 19.1081 22.6066 18.7175L18.364 14.4749C18.3493 14.4603 18.3343 14.4462 18.319 14.4326ZM16.2426 5.28251C18.5858 7.62565 18.5858 11.4246 16.2426 13.7678C13.8995 16.1109 10.1005 16.1109 7.75736 13.7678C5.41421 11.4246 5.41421 7.62565 7.75736 5.28251C10.1005 2.93936 13.8995 2.93936 16.2426 5.28251Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='theme-toggle' title='Toggle Theme'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M12 16C14.2091 16 16 14.2091 16 12C16 9.79086 14.2091 8 12 8V16Z' fill='currentColor'/>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2ZM12 4V8C9.79086 8 8 9.79086 8 12C8 14.2091 9.79086 16 12 16V20C16.4183 20 20 16.4183 20 12C20 7.58172 16.4183 4 12 4Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='toc-toggle' title='Table of Contents'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M2 6C2 5.44772 2.44772 5 3 5H21C21.5523 5 22 5.44772 22 6C22 6.55228 21.5523 7 21 7H3C2.44772 7 2 6.55228 2 6Z' fill='currentColor'/>
          <path d='M2 12.0322C2 11.4799 2.44772 11.0322 3 11.0322H21C21.5523 11.0322 22 11.4799 22 12.0322C22 12.5845 21.5523 13.0322 21 13.0322H3C2.44772 13.0322 2 12.5845 2 12.0322Z' fill='currentColor'/>
          <path d='M3 17.0645C2.44772 17.0645 2 17.5122 2 18.0645C2 18.6167 2.44772 19.0645 3 19.0645H21C21.5523 19.0645 22 18.6167 22 18.0645C22 17.5122 21.5523 17.0645 21 17.0645H3Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
  </header>

  <aside id='left-sidebar'>
    <div class='sidebar-header'>
      <h3>Search & Tags</h3>
      <button class='sidebar-close' title='Close'>
        <svg width='20' height='20' viewBox='0 0 15 15' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M11.7816 4.03157C12.0062 3.80702 12.0062 3.44295 11.7816 3.2184C11.5571 2.99385 11.193 2.99385 10.9685 3.2184L7.50005 6.68682L4.03164 3.2184C3.80708 2.99385 3.44301 2.99385 3.21846 3.2184C2.99391 3.44295 2.99391 3.80702 3.21846 4.03157L6.68688 7.49999L3.21846 10.9684C2.99391 11.193 2.99391 11.557 3.21846 11.7816C3.44301 12.0061 3.80708 12.0061 4.03164 11.7816L7.50005 8.31316L10.9685 11.7816C11.193 12.0061 11.5571 12.0061 11.7816 11.7816C12.0062 11.557 12.0062 11.193 11.7816 10.9684L8.31322 7.49999L11.7816 4.03157Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
    <div class='search-container'>
      <input type='text' id='sidebar-search' placeholder='Search full content or #tags...' autocomplete='off'>
    </div>
    <div id='sidebar-tags' class='tag-cloud'></div>
    <ul id='sidebar-results'></ul>
  </aside>
</div>
<div id="content" class="content">
<h1 class="title">Go: Struct, Method, Interface</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8219015">Structs = Defining a Mathematical Space</a></li>
<li><a href="#org55fe80c">Methods = Intrinsic Operations</a></li>
<li><a href="#org3de2fb7">Interfaces = Algebraic Structures (Axioms)</a></li>
<li><a href="#org6a63dc5">Why though?</a>
<ul>
<li>
<ul>
<li>
<ul>
<li><a href="#orgc3a098d">Let's code</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I am used to the mathematical definition of a function, where \(f: X \to Y\) takes an input from domain \(X\) and maps it to \(Y\), so the object-oriented syntax of Go can look confusing. I need to map Go's syntax to mathematical concepts.
</p>
<div id="outline-container-org8219015" class="outline-2">
<h2 id="org8219015">Structs = Defining a Mathematical Space</h2>
<div class="outline-text-2" id="text-org8219015">
<p>
A <code>struct</code> is like defining an element of a specific mathematical space or set. For example, let's define a vector \(\vec{v} \in \mathbb{R}^2\).
</p>

<p>
In Go, you build this space by defining its components:
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">type</span> <span class="org-type">Vector</span> <span class="org-keyword">struct</span> {
    X <span class="org-type">float64</span>
    Y <span class="org-type">float64</span>
}
</pre>
</div>

<p>
We haven't done any operations yet, just defined the domain.
</p>
</div>
</div>
<div id="outline-container-org55fe80c" class="outline-2">
<h2 id="org55fe80c">Methods = Intrinsic Operations</h2>
<div class="outline-text-2" id="text-org55fe80c">
<p>
Normally, if you wanted to find the Euclidean norm (magnitude) of your vector, you would write a standard function like
\[
f(\vec{v}) = ||\vec{v}||
\]
</p>

<p>
That's pretty trivial in Go
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Function
</span><span class="org-keyword">func</span> <span class="org-function-name">Norm</span>(<span class="org-variable-name">v</span> <span class="org-type">Vector</span>) <span class="org-type">float64</span> {
    <span class="org-keyword">return</span> math.<span class="org-function-name">Sqrt</span>(v.X*v.X + v.Y*v.Y)
}
</pre>
</div>

<p>
A <b>method</b> is the exact same logic, just with a syntax trick. Instead of passing the vector as a standard input parameter, you bind the function <i>directly to the space itself</i>.
</p>

<p>
Like an operator that belongs exclusively to \(\mathbb{R}^2\) (you could say the transformation is limited to 2D, instead of explicitly giving 2D coordinates as inputs)
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Method
</span><span class="org-keyword">func</span> (<span class="org-variable-name">v</span> <span class="org-type">Vector</span>) <span class="org-function-name">Norm</span>() <span class="org-type">float64</span> {
    <span class="org-keyword">return</span> math.<span class="org-function-name">Sqrt</span>(v.X*v.X + v.Y*v.Y)
}
</pre>
</div>

<div class="note" id="org7db5533">
<p>
<b>Why does the syntax look like that?</b>
</p>

<ul class="org-ul">
<li><code>func</code>: We are declaring an operation.</li>
<li><code>(v Vector)</code>: This is called the <b>receiver</b>. It is literally just the input parameter \(x\) in \(f(x) = y\), but we put it <i>before</i> the function name to explicitly state: "This operation is an intrinsic property of the Vector space."</li>
<li><code>Norm()</code>: The name of the operation.</li>
<li><code>float64</code>: The output \(y\).</li>
</ul>

<p>
Because it is bound to the object, you call it by writing <code>v.Norm()</code> instead of <code>Norm(v)</code>.
</p>

</div>
</div>
</div>
<div id="outline-container-org3de2fb7" class="outline-2">
<h2 id="org3de2fb7">Interfaces = Algebraic Structures (Axioms)</h2>
<div class="outline-text-2" id="text-org3de2fb7">
<p>
In abstract algebra, you define structures based purely on their axioms. A "Metric Space" doesn't care if you are dealing with real numbers, matrices, or continuous functions; it just says, "If a set has a distance function \(d(x,y)\) that satisfies certain rules, it is a Metric Space."
</p>

<p>
An <b>Interface</b> in Go is exactly that. It is a set of axioms. It defines a category of objects based purely on the operations (methods) they support, without caring about what the objects actually are.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">type</span> <span class="org-type">Normable</span> <span class="org-keyword">interface</span> {
    <span class="org-function-name">Norm</span>() <span class="org-type">float64</span>
}
</pre>
</div>

<p>
This interface says: /"Let <code>Normable</code> be the set of all objects that have a <code>Norm()</code> operation that returns a <code>float64.</code>" 
Because our <code>Vector</code> struct has a <code>Norm()</code> method, it automatically satisfies the axioms of the <code>Normable</code> interface. You don't have to explicitly declare <code>Vector implements Normable</code>. In Go, if a struct has the required math operations, it automatically belongs to that category.
</p>
</div>
</div>
<div id="outline-container-org6a63dc5" class="outline-2">
<h2 id="org6a63dc5">Why though?</h2>
<div class="outline-text-2" id="text-org6a63dc5">
<p>
Why do we do this instead of just writing \(f(x)\)? Because it allows you to write functions that operate on <i>abstractions</i> rather than specific types.
</p>

<p>
If you write a function that takes an interface as an input:
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">PrintMagnitude</span>(<span class="org-variable-name">n</span> <span class="org-type">Normable</span>) {
    fmt.<span class="org-function-name">Println</span>(n.<span class="org-function-name">Norm</span>())
}
</pre>
</div>

<p>
You can pass your 2D <code>Vector</code> into it. But if tomorrow you define a complex number \(z = a + bi\) as a struct, and give it its own <code>Norm()</code> method, you can pass that complex number into <code>PrintMagnitude</code> too. The function only cares that the axioms are met.
</p>


<p>
would it help to write out a quick, compilable Go script together where
we implement an interface for something concrete, like a basic matrix
operation?
</p>
</div>
<div id="outline-container-orgc3a098d" class="outline-5">
<h5 id="orgc3a098d">Let's code</h5>
<div class="outline-text-5" id="text-orgc3a098d">
<p>
Let's model a <b>Linear Transformation</b>
\[
T: \mathbb{R}^2 \to \mathbb{R}^2
\]
</p>

<p>
In this script, we will define a Vector space, and then we will define an interface (our axioms) called <code>Transformer</code>. Any object that can map a vector to a new vector satisfies this interface. We will then build two very different mathematical objects&#x2014;a Scalar and a 2x2 Matrix&#x2014;and prove that Go treats them as the exact same category of object.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">package</span> main

<span class="org-keyword">import</span> <span class="org-string">"fmt"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">1. THE SPACE (Struct)
</span><span class="org-comment-delimiter">// </span><span class="org-comment">We define our mathematical domain: a 2D Vector space.
</span><span class="org-keyword">type</span> <span class="org-type">Vector</span> <span class="org-keyword">struct</span> {
    X <span class="org-type">float64</span>
    Y <span class="org-type">float64</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">2. THE AXIOMS (Interface)
</span><span class="org-comment-delimiter">// </span><span class="org-comment">This is the abstract category.
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Rule: To be a "Transformer", you must have an intrinsic operation called Apply()
</span><span class="org-comment-delimiter">// </span><span class="org-comment">that takes a Vector as input and outputs a new transformed Vector.
</span><span class="org-keyword">type</span> <span class="org-type">Transformer</span> <span class="org-keyword">interface</span> {
    <span class="org-function-name">Apply</span>(<span class="org-variable-name">v</span> <span class="org-type">Vector</span>) <span class="org-type">Vector</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">3. OBJECT A (Struct + Method)
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Let's define uniform scaling. A Scaler just needs a single factor.
</span><span class="org-keyword">type</span> <span class="org-type">Scaler</span> <span class="org-keyword">struct</span> {
    Factor <span class="org-type">float64</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Intrinsic Operation for Scaler
</span><span class="org-comment-delimiter">// </span><span class="org-comment">It implements Apply(), so the Go compiler silently labels Scaler as a "Transformer"
</span><span class="org-keyword">func</span> (<span class="org-variable-name">s</span> <span class="org-type">Scaler</span>) <span class="org-function-name">Apply</span>(<span class="org-variable-name">v</span> <span class="org-type">Vector</span>) <span class="org-type">Vector</span> {
    <span class="org-keyword">return</span> <span class="org-type">Vector</span>{
        <span class="org-constant">X</span>: v.X * s.Factor,
        <span class="org-constant">Y</span>: v.Y * s.Factor,
    }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">4. OBJECT B (Struct + Method)
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Let's define a 2x2 Matrix for more complex transformations (like rotation).
</span><span class="org-keyword">type</span> <span class="org-type">Matrix</span> <span class="org-keyword">struct</span> {
    A, B <span class="org-type">float64</span> <span class="org-comment-delimiter">// </span><span class="org-comment">Top row
</span>    C, D <span class="org-type">float64</span> <span class="org-comment-delimiter">// </span><span class="org-comment">Bottom row
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Intrinsic Operation for Matrix
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Standard matrix-vector multiplication.
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Because it also implements Apply(), Matrix is also labeled a "Transformer".
</span><span class="org-keyword">func</span> (<span class="org-variable-name">m</span> <span class="org-type">Matrix</span>) <span class="org-function-name">Apply</span>(<span class="org-variable-name">v</span> <span class="org-type">Vector</span>) <span class="org-type">Vector</span> {
    <span class="org-keyword">return</span> <span class="org-type">Vector</span>{
        <span class="org-constant">X</span>: (m.A * v.X) + (m.B * v.Y),
        <span class="org-constant">Y</span>: (m.C * v.X) + (m.D * v.Y),
    }
}

<span class="org-comment-delimiter">// </span><span class="org-comment">5. THE POWER OF ABSTRACTION
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Notice the input type here is "Transformer".
</span><span class="org-comment-delimiter">// </span><span class="org-comment">This function does NOT care if you give it a Scaler, a Matrix, or something else entirely.
</span><span class="org-comment-delimiter">// </span><span class="org-comment">It only cares that the object obeys the axiom: it has an Apply() method.
</span><span class="org-keyword">func</span> <span class="org-function-name">PrintTransformation</span>(<span class="org-variable-name">name</span> <span class="org-type">string</span>, <span class="org-variable-name">t</span> <span class="org-type">Transformer</span>, <span class="org-variable-name">v</span> <span class="org-type">Vector</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">We call the method bound to whatever object 't' happens to be
</span>    <span class="org-variable-name">result</span> := t.<span class="org-function-name">Apply</span>(v)
    fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%s applied to (%.1f, %.1f) -&gt; (%.1f, %.1f)\n"</span>, name, v.X, v.Y, result.X, result.Y)
}

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">A starting vector (2, 3)
</span>    <span class="org-variable-name">v</span> := <span class="org-type">Vector</span>{<span class="org-constant">X</span>: 2.0, <span class="org-constant">Y</span>: 3.0}

    <span class="org-comment-delimiter">// </span><span class="org-comment">Instantiate a Scaler that scales by 3
</span>    <span class="org-variable-name">myScaler</span> := <span class="org-type">Scaler</span>{<span class="org-constant">Factor</span>: 3.0}

    <span class="org-comment-delimiter">// </span><span class="org-comment">Instantiate a Matrix representing a 90-degree counter-clockwise rotation
</span>    <span class="org-variable-name">myMatrix</span> := <span class="org-type">Matrix</span>{
        <span class="org-constant">A</span>: 0.0, <span class="org-constant">B</span>: -1.0,
        <span class="org-constant">C</span>: 1.0, <span class="org-constant">D</span>: 0.0,
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Even though myScaler and myMatrix are entirely different structs in memory,
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">we can pass them into the exact same parameter because they both satisfy the interface.
</span>    <span class="org-function-name">PrintTransformation</span>(<span class="org-string">"Scalar x3"</span>, myScaler, v)
    <span class="org-function-name">PrintTransformation</span>(<span class="org-string">"90-deg Rotation"</span>, myMatrix, v)
}
</pre>
</div>

<p>
<b>Output</b>
</p>
<div class="org-src-container">
<pre class="src src-text">Scalar x3 applied to (2.0, 3.0) -&gt; (6.0, 9.0)
90-deg Rotation applied to (2.0, 3.0) -&gt; (-3.0, 2.0)
</pre>
</div>

<p>
Look closely at step 5 in the code. If we didn't have interfaces, we would have been forced to write two completely separate functions: <code>PrintScalerTransformation(name, s Scaler, v Vector)</code> and <code>PrintMatrixTransformation(name, m Matrix, v Vector)</code>.
</p>

<p>
By defining the <code>Transformer</code> interface, we created a single generalized mathematical rule that allows the <code>PrintTransformation</code> function to operate purely on the <i>behavior</i> of the objects, ignoring what the objects actually are under the hood.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Built with Emacs</p>
</div>
</body>
</html>
